juanchang23301/LAB04-STM32F4/LAB04/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define Disp_A_Pin GPIO_PIN_0
#define Disp_A_GPIO_Port GPIOC
#define Disp_B_Pin GPIO_PIN_1
#define Disp_B_GPIO_Port GPIOC
#define Push_P1_Pin GPIO_PIN_0
#define Push_P1_GPIO_Port GPIOA
#define Push_P1_EXTI_IRQn EXTI0_IRQn
#define Push_P2_Pin GPIO_PIN_1
#define Push_P2_GPIO_Port GPIOA
#define Push_P2_EXTI_IRQn EXTI1_IRQn
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define Push_Timer_Pin GPIO_PIN_4
#define Push_Timer_GPIO_Port GPIOA
#define Push_Timer_EXTI_IRQn EXTI4_IRQn
#define P1_Led2_Pin GPIO_PIN_5
#define P1_Led2_GPIO_Port GPIOA
#define P1_Led1_Pin GPIO_PIN_6
#define P1_Led1_GPIO_Port GPIOA
#define P2_Led4_Pin GPIO_PIN_7
#define P2_Led4_GPIO_Port GPIOA
#define Disp_F_Pin GPIO_PIN_10
#define Disp_F_GPIO_Port GPIOB
#define P2_Led2_Pin GPIO_PIN_7
#define P2_Led2_GPIO_Port GPIOC
#define Disp_G_Pin GPIO_PIN_8
#define Disp_G_GPIO_Port GPIOA
#define P2_Led1_Pin GPIO_PIN_9
#define P2_Led1_GPIO_Port GPIOA
#define Disp_C_Pin GPIO_PIN_10
#define Disp_C_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define Disp_E_Pin GPIO_PIN_4
#define Disp_E_GPIO_Port GPIOB
#define Disp_D_Pin GPIO_PIN_5
#define Disp_D_GPIO_Port GPIOB
#define P2_Led3_Pin GPIO_PIN_6
#define P2_Led3_GPIO_Port GPIOB
#define P1_Led3_Pin GPIO_PIN_8
#define P1_Led3_GPIO_Port GPIOB
#define P1_Led4_Pin GPIO_PIN_9
#define P1_Led4_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
